# SetUIDocumentMacroSecurityOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIMacroManager..::..SetUIDocumentMacroSecurityOptions Method
UIMacroManager Class See Also
---
Sets the UI document macro security options.
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static void SetUIDocumentMacroSecurityOptions(
	UIApplication application,
	UIDocumentMacroOptions macroOptions
)
```

Visual Basic
---
```text
Public Shared Sub SetUIDocumentMacroSecurityOptions ( _
	application As UIApplication, _
	macroOptions As UIDocumentMacroOptions _
)
```

Visual C++
---
```text
public:
static void SetUIDocumentMacroSecurityOptions(
	UIApplication^ application,
	UIDocumentMacroOptions macroOptions
)
```

# ### Parameters
application
    Type: Autodesk.Revit.UI..::..UIApplication The UI application.
macroOptions
    Type: Autodesk.Revit.UI.Macros..::..UIDocumentMacroOptions The UI document macro security options.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was NULL |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace